app/Cells/CategoryMenu.php

SELECT `categories`.`name`, `categories`.`slug`
FROM `categories`
---
    public function render( string $view) {
        $category = new Category();
        $categories = $category->select('categories.name, categories.slug')->findAll();