app/Cells/CategoryCell.php

SELECT `categories`.`name`, `categories`.`slug`
FROM `categories`
---
    public function render() {
        $category = new Category();
        $categories = $category->select('categories.name, categories.slug')->findAll();