app/Controllers/BannerHome.php

    public function index()
    {
        helper('text');

        $post = new Post();
        $recents = $post->select('posts.title, posts.description, posts.image'
        )->join(
            'users',
            'users.id = posts.user_id'
        ) -> join(
            'categories',
            'categories.id = posts.category_id'
        )->orderBy('posts.id', 'desc')->findAll(4);
---
SELECT `posts`.`title`, `posts`.`description`, `posts`.`image`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
ORDER BY `posts`.`id` DESC
 LIMIT 4