app/Controllers/Category.php

    public function index(string $slug)
    {
        helper('text');

        $category = new ModelsCategory();
        $category = $category->select('categories.id')->where('slug', $slug)->first();
---
SELECT `categories`.`id`
FROM `categories`
WHERE `slug` = 'lot'
 LIMIT 1