app/Controllers/Category.php

SELECT `posts`.`id`, `posts`.`image`, `posts`.`title`, `posts`.`created_at`, `posts`.`slug`, `posts`.`description`, `categories`.`name` as `categoryName`, `users`.`firstName` as `userFirstName`, `users`.`lastName` as `userLastName`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`category_id` = '1'
 LIMIT 5, 5
---
    public function index(string $category)
    {

        helper('text');

        if (!array_key_exists($category, $this->categories)) {
            $categoryId = 1;
        } else {
            $categoryId = $this->categories[$category];
        };

        $post = new Post();
        $posts = $post->select(
            'posts.title, posts.image, posts.description, posts.slug, posts.created_at, users.firstName as userFirstName, users.lastName as userLastName, categories.name as categoryName, category_id'
        )->where('category_id', $categoryId)
            ->join(
                'users',
                'users.id = posts.user_id'
            )
            ->join(
                'categories',
                'categories.id = posts.category_id'
            )->findAll(10);