app/Controllers/CategorySidebarPartials.php

    public function index(string $category)
    {
        $order = match($category) {
            'popular' => ['visits', 'asc'],
            'trending' => ['visits', 'asc'],
            'latest' => ['posts.id', 'desc'],
            'default' => ['posts.id', 'desc']
        };

        $post = new Post();
        $posts = $post ->select(
            'posts.image, posts.slug, posts.title, posts.created_at, users.firstName as userFirstName, users.lastName as userLastName, categories.name as categoryName'
        ) ->join(
            'users',
            'users.id = posts.user_id'
        ) ->join(
            'categories',
            'categories.id = posts.category_id'
        ) -> orderBy($order[0], $order[1]) ->findAll(5);
---
SELECT `posts`.`image`, `posts`.`slug`, `posts`.`title`, `posts`.`created_at`, `users`.`firstName` as `userFirstName`, `users`.`lastName` as `userLastName`, `categories`.`name` as `categoryName`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
ORDER BY `posts`.`id` DESC
 LIMIT 5