app/Controllers/Recent.php

SELECT `posts`.`id`, `posts`.`title`, `posts`.`image`, `posts`.`created_at`, `posts`.`description`, `categories`.`name` as `categoryName`, `users`.`firstName` as `userFirstName`, `users`.`lastName` as `userLastName`, `users`.`image` as `userImage`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
ORDER BY `posts`.`id` DESC
 LIMIT 7
---
    public function index()
    {
        helper('text');

        $post = new Post();
        $recent = $post->select(
            'posts.id, posts.title, posts.image, posts.created_at, posts.description, categories.name as categoryName, users.firstName as userFirstName, users.lastName as userLastName'
        )->join(
            'users',
            'users.id = posts.user_id'
        )->join(
            'categories',
            'categories.id = posts.category_id'
        )->orderBy('posts.id', 'desc')->findAll(7);