app/Controllers/Trending.php

    public function index()
    {

        $post = new Post();
       $posts =  $post->select('
        posts.title, users.firstName as userFirstName, users.lastName as userLastName'
        )->orderBy(
            'visits',
            'desc'
        )->join(
            'users',
            'users.id = posts.user_id'
        )->findAll(5);
---
SELECT `posts`.`title`, `users`.`firstName` as `userFirstName`, `users`.`lastName` as `userLastName`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
ORDER BY `visits` DESC
 LIMIT 5